log/log.gpgizeme/exp/star_parthenon/case_study/parthenon.nvme_in_virt/p7n.nvme_in_virt/result/FIO_20140710_231941.tgNVME_NATIVE_tyRW_qd192_nj192_bs4k.out
tgNVME_NATIVE_tyRW_qd192_nj192_bs4k: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=192
...
fio-2.1.10-2-g3e2e
Starting 192 processes

tgNVME_NATIVE_tyRW_qd192_nj192_bs4k: (groupid=0, jobs=192): err= 0: pid=19534: Thu Jul 10 23:21:12 2014
  write: io=47874MB, bw=816674KB/s, iops=203557, runt= 60028msec
    slat (usec): min=3, max=76308, avg=939.97, stdev=5932.81
    clat (usec): min=6, max=724929, avg=179961.61, stdev=92106.62
     lat (usec): min=33, max=769844, avg=180903.54, stdev=92443.81
    clat percentiles (usec):
     |  1.00th=[ 1576],  5.00th=[35072], 10.00th=[66048], 20.00th=[103936],
     | 30.00th=[128512], 40.00th=[152576], 50.00th=[177152], 60.00th=[199680],
     | 70.00th=[224256], 80.00th=[257024], 90.00th=[301056], 95.00th=[337920],
     | 99.00th=[411648], 99.50th=[440320], 99.90th=[501760], 99.95th=[528384],
     | 99.99th=[569344]
    bw (KB  /s): min=    0, max=14592, per=0.52%, avg=4207.64, stdev=1431.30
    lat (usec) : 10=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
    lat (usec) : 750=0.04%, 1000=0.09%
    lat (msec) : 2=1.95%, 4=1.62%, 10=0.51%, 20=0.07%, 50=4.43%
    lat (msec) : 100=10.33%, 250=59.31%, 500=21.83%, 750=0.10%
  cpu          : usr=0.54%, sys=3.60%, ctx=10170797, majf=0, minf=12007
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=150.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=12219159/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=192

Run status group 0 (all jobs):
  WRITE: io=47874MB, aggrb=816674KB/s, minb=816674KB/s, maxb=816674KB/s, mint=60028msec, maxt=60028msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

Additional Terse Output:
3;fio-2.1.10-2-g3e2e;tgNVME_NATIVE_tyRW_qd192_nj192_bs4k;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;49023324;816674;203557;60028;3;76308;939.973409;5932.806966;6;724929;179961.615000;92106.621167;1.000000%=1576;5.000000%=35072;10.000000%=66048;20.000000%=103936;30.000000%=128512;40.000000%=152576;50.000000%=177152;60.000000%=199680;70.000000%=224256;80.000000%=257024;90.000000%=301056;95.000000%=337920;99.000000%=411648;99.500000%=440320;99.900000%=501760;99.950000%=528384;99.990000%=569344;0%=0;0%=0;0%=0;33;769844;180903.536708;92443.814714;0;14592;0.515217%;4207.643768;1431.299736;0.540582%;3.599736%;10170797;0;12007;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;150.1%;0.00%;0.00%;0.01%;0.00%;0.01%;0.01%;0.01%;0.01%;0.04%;0.09%;1.95%;1.62%;0.51%;0.07%;4.43%;10.33%;59.31%;21.83%;0.10%;0.00%;0.00%;0.00%